InformationRegisters/КорректныеКорреспонденцииСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КорректныеКорреспонденцииСчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КорректныеКорреспонденцииСчетов/Forms/ФормаСпискаКорреспонденций/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Описание формы
// Параметры фомры:
//  ТаблицаКорреспонденций - ДанныеФормыКоллекция (ТаблицаЗначений)
//  
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТаблицаКорреспонденций") Тогда
		ТаблицаКорреспонденций.Загрузить(Параметры.ТаблицаКорреспонденций.Выгрузить());
		
		Для Каждого СтрокаКорресп ИЗ ТаблицаКорреспонденций Цикл
			СтрокаКорресп.Пометка = Истина;
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ <ИМЯ ТАБЛИЦЫ ФОРМЫ>

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого Корреспонденция Из ТаблицаКорреспонденций Цикл
		Корреспонденция.Пометка = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого Корреспонденция Из ТаблицаКорреспонденций Цикл
		Корреспонденция.Пометка = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ЗаписатьКорреспонденцииНаСервере();
	
	Если ЕстьДобавленныеЗаписи Тогда
		Оповестить("ОбновлениеКорреспонденцииСчетов");
	КонецЕсли;	
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаписатьКорреспонденцииНаСервере()

	Набор = РегистрыСведений.КорректныеКорреспонденцииСчетов.СоздатьНаборЗаписей();

	Для Каждого Корреспонденция Из ТаблицаКорреспонденций Цикл
		Если Корреспонденция.Пометка Тогда

			Набор.Отбор.СчетДт.Установить(Корреспонденция.СчетДт);
			Набор.Отбор.СчетКт.Установить(Корреспонденция.СчетКт);

			Запись = Набор.Добавить();

			Запись.СчетДт      = Корреспонденция.СчетДт;
			Запись.СчетКт      = Корреспонденция.СчетКт;
			Запись.Комментарий = Корреспонденция.Комментарий;

			Набор.Записать();
			Набор.Очистить();

			ЕстьДобавленныеЗаписи = Истина;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
